<a href="https://colab.research.google.com/github/ksh001/ksh0011/blob/main/Py_Study_pandas1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Pandas study 20.12.31.

In [5]:
import pandas as pd

In [44]:
df = pd.DataFrame(
  {"a" : [4 ,5, 6],
  "b" : [7, 8, 9],
  "c" : [10, 11, 12]},
index = [1, 2, 3])

In [17]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [30]:
df = pd.DataFrame( #low
  [[4, 7, 10],
  [5, 8, 11], 
  [6, 9, 12]],
  index=[1, 2, 3],
  columns=['a', 'b', 'c']) #colums
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [31]:
df.loc[2]

a     5
b     8
c    11
Name: 2, dtype: int64

In [41]:
df.loc[[1, 2], ['a', 'b'] ]

   a  b
1  4  7
2  5  8

In [46]:
df.a > 5

1    False
2    False
3     True
Name: a, dtype: bool

In [49]:
df[df.a > 4] #a열을 기준으로 True인 행을 모두 가져오겠다.

   a  b   c
2  5  8  11
3  6  9  12

In [54]:
df = pd.DataFrame(
  {"apple" : [4 ,5, 6, 6],
  "bee" : [7, 8, 9, 9],
  "cat" : [10, 11, 12, 12]},
index = pd.MultiIndex.from_tuples(
  [('d',1),('d',2),('e',1), ('e',2)],
  names=['n','v']))

df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 1  6  9  12
  2  6  9  12

In [23]:
df['a']

n  v
d  1    4
   2    5
e  2    6
Name: a, dtype: int64

In [25]:
df.a

n  v
d  1    4
   2    5
e  2    6
Name: a, dtype: int64

In [36]:
df.loc[('d',2)]

a     5
b     8
c    11
Name: (d, 2), dtype: int64

In [38]:
df.loc[('e',2), 'c']

12

In [43]:
df.loc[[('d', 1), ('e', 2)], ['a', 'b', 'c']]

     a  b   c
n v
d 1  4  7  10
e 2  6  9  12

In [55]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 1  6  9  12
  2  6  9  12

In [56]:
df.drop_duplicates() #중복되는 열 제거 _ 아예 지우는 게 아니라 출력만 / df에 대입하면 제거됨

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 1  6  9  12

In [57]:
df.head(2)#위에서부터 2개의 행 가져오기

     a  b   c
n v
d 1  4  7  10
  2  5  8  11

In [58]:
df.tail(1) #뒤에서 1개 가져오기

     a  b   c
n v
e 2  6  9  12

In [72]:
df.sample(frac=0.6) # 더 가까운 곳으로 뜬다

     a  b   c
n v
d 2  5  8  11
  1  4  7  10

In [81]:
df.iloc[0: 3]  #  배열의 index처럼 시작점과 끝지점으로부터 한 칸 더(이터레이터?) : [시작위치, 끝 위치 + 1]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 1  6  9  12

In [95]:
df.nlargest(3, 'a') # df.nlargest(n, 'value') : 'b'열에서 제일 큰 값 순서로 3개

     a  b   c
n v
e 1  6  9  12
  2  6  9  12
d 2  5  8  11

In [96]:
df.nsmallest(2, 'a')

     a  b   c
n v
d 1  4  7  10
  2  5  8  11

In [98]:
df[['a', 'c']]

     a   c
n v
d 1  4  10
  2  5  11
e 1  6  12
  2  6  12

In [100]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 1  6  9  12
  2  6  9  12

In [103]:
df.filter(regex='^a') #a로 시작하는 것만 뜸

     a
n v
d 1  4
  2  5
e 1  6
  2  6

In [104]:
df.filter(regex='e$') #e로 끝나는 것만 뜸

Empty DataFrame
Columns: []
Index: [(d, 1), (d, 2), (e, 1), (e, 2)]